Revit 2027 API
MEPSystemType.FillPatternId Property
 Indicates the fill pattern id that should override the fill pattern id for all components in the system.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ElementId FillPatternId { get; set; }
Public Property FillPatternId As ElementId
	Get
	Set
public:
property ElementId^ FillPatternId {
	ElementId^ get ();
	void set (ElementId^ value);
}
member FillPatternId : ElementId with get, set
Property Value
ElementId
Exceptions
Exception | Condition
ArgumentNullException |  When setting this property: A non-optional argument was null
See Also
Reference
MEPSystemType Class
Autodesk.Revit.DB Namespace